# Module1-Exc2 - Getting and Knowing your Data

- Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries and read the dataset

In [49]:
import pandas as pd
df = pd.read_csv('occ.csv')

### Step 2. See the first 25 entries

In [51]:
df.head(25)

    age gender     occupation zip_code
0    24      M     technician    85711
1    53      F          other    94043
2    23      M         writer    32067
3    24      M     technician    43537
4    33      F          other    15213
5    42      M      executive    98101
6    57      M  administrator    91344
7    36      M  administrator    05201
8    29      M        student    01002
9    53      M         lawyer    90703
10   39      F          other    30329
11   28      F          other    06405
12   47      M       educator    29206
13   45      M      scientist    55106
14   49      F       educator    97301
15   21      M  entertainment    10309
16   30      M     programmer    06355
17   35      F          other    37212
18   40      M      librarian    02138
19   42      F      homemaker    95660
20   26      M         writer    30068
21   25      M         writer    40206
22   30      F         artist    48197
23   21      F         artist    94533
24   39      M       engineer    55107

### Step 3. See the last 10 entries

In [54]:
df.tail(10)

     age gender     occupation zip_code
933   61      M       engineer    22902
934   42      M         doctor    66221
935   24      M          other    32789
936   48      M       educator    98072
937   38      F     technician    55038
938   26      F        student    33319
939   32      M  administrator    02215
940   20      M        student    97229
941   48      F      librarian    78209
942   22      M        student    77841

### Step 4. What is the number of observations in the dataset?

In [57]:
df.shape

(943, 4)

### Step 5. What is the number of columns in the dataset?

In [60]:
print(f'Number of columns is {df.shape[1]}')

Number of columns is 4

### Step 6. Print the name of all the columns.

In [63]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 7. How is the dataset indexed?

In [66]:
df.index

RangeIndex(start=0, stop=943, step=1)

### Step 8. What is the data type of each column?

In [71]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 9. Print only the occupation column

In [73]:
df['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

### Step 10. How many different occupations are in this dataset?

In [79]:
df['occupation'].value_counts()

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

### Step 11. What is the most frequent occupation?

In [107]:
df['occupation'].mode().iloc[0]

'student'

### Step 12. Summarize the DataFrame.

In [119]:
df.describe(include = 'all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 13. Summarize all the columns

In [117]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 14. Summarize only the occupation column

In [115]:
df['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 15. What is the mean age of users?

In [121]:
df.age.mean()

34.05196182396607

### Step 16. What is the age with least occurrence?

In [129]:
df.age.value_counts(ascending=True)

age
73     1
10     1
66     1
7      1
11     1
      ..
27    35
28    36
22    37
25    38
30    39
Name: count, Length: 61, dtype: int64

In [127]:
df.age.value_counts()[df.age.value_counts()==1]

age
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64